Revit 2027 API
LineProperties.LineWidth Property
 The current width (thickness) of the pen stroke when drawing lines/curves.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double LineWidth { get; }
Public ReadOnly Property LineWidth As Double
	Get
public:
property double LineWidth {
	double get ();
}
member LineWidth : float with get
Property Value
Double
See Also
Reference
LineProperties Class
Autodesk.Revit.DB Namespace